examples/OpenFOAM_cavity/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//nu              [0 2 -1 0 0 0 0] 0.01; // @nu default
nu              [0 2 -1 0 0 0 0] 1e-6; // @nu water
//nu              [0 2 -1 0 0 0 0] 1.5e-5; // @nu air


// ************************************************************************* //
